# Sqr

## Description
Function Sqr returns the square of the specified value.

```pascal
FUNCTION Sqr(v : REAL) : REAL;
```

```python

def vs.Sqr(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Value to square.|

## Version
Availability: from MiniCAD
## Category
* Math - General